# Module 7 - Hands On 2 - Data Manipulation

Step 4: Import the required packages and read the data.

In [1]:
import numpy as np
import pandas as pd

In [2]:
data = pd.read_csv('housing.csv')

In [3]:
data.head()

      RM  LSTAT  PTRATIO      MEDV
0  6.575   4.98     15.3  504000.0
1  6.421   9.14     17.8  453600.0
2  7.185   4.03     17.8  728700.0
3  6.998   2.94     18.7  701400.0
4  7.147   5.33     18.7  760200.0

Step 5: Analyze the shape of data.

In [4]:
data.shape

(489, 4)

Step 6: Extract a subset of data using iloc.

In [5]:
data.iloc[:5, :]

      RM  LSTAT  PTRATIO      MEDV
0  6.575   4.98     15.3  504000.0
1  6.421   9.14     17.8  453600.0
2  7.185   4.03     17.8  728700.0
3  6.998   2.94     18.7  701400.0
4  7.147   5.33     18.7  760200.0

In [6]:
data.iloc[2:5, :2]

      RM  LSTAT
2  7.185   4.03
3  6.998   2.94
4  7.147   5.33

In [7]:
data.iloc[2:4, 1:2]

   LSTAT
2   4.03
3   2.94

Step 7: Extract a subset of data using loc.

In [8]:
data.loc[:5, ['LSTAT', 'MEDV']]

   LSTAT      MEDV
0   4.98  504000.0
1   9.14  453600.0
2   4.03  728700.0
3   2.94  701400.0
4   5.33  760200.0
5   5.21  602700.0

Step 8: Change all values in LSTAT column to 1.

In [9]:
data['LSTAT'] = 1
data.head()

      RM  LSTAT  PTRATIO      MEDV
0  6.575      1     15.3  504000.0
1  6.421      1     17.8  453600.0
2  7.185      1     17.8  728700.0
3  6.998      1     18.7  701400.0
4  7.147      1     18.7  760200.0

Step 9: Apply function to change LSTAT value to its double (multiply by 2).

In [10]:
data['LSTAT'] = data['LSTAT'].apply(lambda x : x*2)
data.head()

      RM  LSTAT  PTRATIO      MEDV
0  6.575      2     15.3  504000.0
1  6.421      2     17.8  453600.0
2  7.185      2     17.8  728700.0
3  6.998      2     18.7  701400.0
4  7.147      2     18.7  760200.0